---
type: PointOnEdgeEdgeIntersection
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# PointOnEdgeEdgeIntersection

`Autodesk.Revit.DB.PointOnEdgeEdgeIntersection` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetEdgeReference1 | — | `public Reference GetEdgeReference1 ()` |
| Method | GetEdgeReference2 | — | `public Reference GetEdgeReference2 ()` |
| Method | SetEdgeReference1 | — | `public void SetEdgeReference1 ( Reference edgeReference )` |
| Method | SetEdgeReference2 | — | `public void SetEdgeReference2 ( Reference edgeReference )` |